[
{"movie_title": "Varisu (Hindi)", "description": "Vijay Rajendran is a happy to go lucky man. Things change when his father becomes terminally ill, and he is left to manage his business empire.", "season": "", "year": "2023", "rating": "6.1", "age_rating": "U/A 13+"},
{"movie_title": "Shershaah", "description": "The film Shershaah is the story of PVC awardee brave Indian soldier Capt. Vikram Batra, whose indomitable spirit and unflinching courage in chasing the Pakistani soldiers out of Indian territory contributed immensely in India finally winning the Kargil War in 1999.", "season": "", "year": "2021", "rating": "8.3", "age_rating": "U/A 13+"},
{"movie_title": "The Family Man - Season 1 (Available in Hindi, English, Telugu & Tamil)", "description": "The Family Man is an edgy action-drama series, which tells the story of a middle-class man who works for a special cell of the National Investigation Agency. While he tries to protect the nation from terrorists, he also has to protect his family from the impact of his secretive, high-pressure, and low paying job.", "season": "", "year": "2019", "rating": "8.7", "age_rating": "A"},
{"movie_title": "Pushpa", "description": "Pushpa Raj (Allu Arjun) a coolie, volunteers to smuggle red sanders, a rare wood that only grows in Andhra, with the help of novel ideas to smuggle the red sanders. Pushpa quickly becomes leader of red sanders smuggling network. While Pushpa is at his prime, a ruthless police officer Bhanwar Singh Shekhawat (Fahadh Faasil) takes charge as SP and ridicules Pushpa for his lineage.", "season": "", "year": "2022", "rating": "7.6", "age_rating": "U/A 13+"},
{"movie_title": "The Lair", "description": "Shot down over one of the most dangerous rebel strongholds in Afghanistan, a Royal Air Force pilot discovers an abandoned Soviet Research Facility concealed in the remote hills. She finds refuge in an underground bunker where deadly man-made biological weapons - half human, half alien and hungry for human flesh are awakened as she watches the creatures rip apart the men pursuing her.", "season": "", "year": "2022", "rating": "4.5", "age_rating": "A"},
{"movie_title": "Fall", "description": "For best friends Becky and Hunter, life is all about conquering fears and pushing limits. However, after they climb 2,000 feet to the top of a remote, abandoned radio tower, they find themselves stranded with no way down. Now, their expert climbing skills are put to the ultimate test as they desperately fight to survive the elements, a lack of supplies, and vertigo-inducing heights.", "season": "", "year": "2022", "rating": "", "age_rating": "U/A 16+"},
{"movie_title": "Harry Potter and the Sorcerer's Stone", "description": "Based on the wildly popular J.K. Rowling's book about a young boy who on his eleventh birthday discovers, he is the orphaned boy of two powerful wizards and has unique magical powers.", "season": "", "year": "2001", "rating": "7.6", "age_rating": "U/A 13+"},
{"movie_title": "The Blackout", "description": "The Blackout is a 2019 Russian science fiction action thriller film directed by Egor Baranov and starring Pyotr Fyodorov. The film is about an event that suddenly plunges the entire world into darkness, rapidly destroying life on Earth except for a small area in Eastern Europe.", "season": "", "year": "2019", "rating": "6.1", "age_rating": "A"},
{"movie_title": "Sayen", "description": "In the forests of southern Chile, a young Mapuche woman, Sayen, sets out to hunt down the mercenaries who murdered her grandmother.  Utilizing her training, she is able to survive and turn the tables on these interlopers.  She must choose between walking away, or protecting not only her own but also other indigenous groups from the sinister corporation that threatens their lands and livelihoods.", "season": "", "year": "2023", "rating": "4.6", "age_rating": "U/A 16+"},
{"movie_title": "Vaarasdara", "description": "Vijay, the prodigal son of business tycoon Rajendran agrees to take over the reins of the business, much to the chagrin of his brothers. But can Vijay prove himself to be a worthy varisu and also reunite his now-broken family? This movie is also available as Varisu (Tamil), Vaarasudu (Telugu) and Vamshajan (Malayalam)", "season": "", "year": "2023", "rating": "6.1", "age_rating": "U/A 13+"},
{"movie_title": "Yashoda", "description": "An innocent woman, Yashoda, agrees to be a surrogate mother due to her circumstances. She then finds herself trapped in a world of uncertainties. Amidst a myriad of politicians, doctors, and powerful people, how does she battle her way out?", "season": "", "year": "2022", "rating": "6.6", "age_rating": "U/A 13+"},
{"movie_title": "F9", "description": "The true meaning of family gets tested like never before as Dom Toretto takes the team on a worldwide ride with high-stakes action, old friends and a surprising new foe.", "season": "", "year": "2021", "rating": "5.2", "age_rating": "A"},
{"movie_title": "Sita Ramam", "description": "Afreen, a rebellious Pakistani student sets ablaze the car of an Indian in London. Refused to apologize, Afreen is asked to return 1 Million in 1 month. Angered Afreen comes back to Pakistan to get the money from her grandfather. The late grandfather assigns a letter delivering task to Afreen, written by Ram to Sita. Afreen sets out to find Ram and gradually unveils the story of Sita and Ram.", "season": "", "year": "2022", "rating": "8.6", "age_rating": "U"},
{"movie_title": "Sultan", "description": "Sultan is a classic underdog tale about a wrestler's journey, looking for a comeback by defeating all odds staked up against him. But when he has nothing to lose and everything to gain in this fight for his life match, he must literally fight for his life. Sultan believes he’s got what it takes, but this time, it’s going to take everything he’s got.", "season": "", "year": "2016", "rating": "7.0", "age_rating": "U/A 13+"},
{"movie_title": "Hunt", "description": "ACP Arjun Prasad has managed to track down his friend's killer when he meets with an accident resulting in partial memory loss. Soon, he is reassigned to investigate the murder and find the culprit.", "season": "", "year": "2023", "rating": "6.3", "age_rating": "U/A 13+"},
{"movie_title": "Pushpa", "description": "Pushpa Raj (Allu Arjun) a coolie, volunteers to smuggle red sanders, a rare wood that only grows in Andhra, with the help of novel ideas to smuggle the red sanders. Pushpa quickly becomes leader of red sanders smuggling network. While Pushpa is at his prime, a ruthless police officer Bhanwar Singh Shekhawat (Fahadh Faasil) takes charge as SP and ridicules Pushpa for his lineage.", "season": "", "year": "2022", "rating": "7.6", "age_rating": "U/A 13+"},
{"movie_title": "Mirzapur - Season 2", "description": "In Mirzapur, revenge runs darker than blood. There is one title, the King of Mirzapur, but many takers. Munna feels invincible after escaping from the wedding massacre. Guddu and Golu are nowhere to be found. Akhandanand’s ambitions soar as he eyes political power. Going beyond Purvanchal to the power corridors of Lucknow and the streets of Bihar, there’s one question – who will rule Mirzapur?", "season": "", "year": "2020", "rating": "8.5", "age_rating": "A"},
{"movie_title": "Harry Potter and the Chamber of Secrets", "description": "Harry returns to Hogwarts, still famous and a hero, when strange things start to happen... people are turning to stone and no-one knows what, or who, is doing it.", "season": "", "year": "2003", "rating": "7.4", "age_rating": "U/A 13+"},
{"movie_title": "Padmaavat", "description": "Set in 1303 AD medieval India, Padmaavat is the story of honor, valor and obsession. Queen Padmavati is known for her exceptional beauty along with a strong sense of justice and is the wife of Maharawal Ratan Singh and pride of the Kingdom of Chittor, a prosperous kingdom in the north west of India. The legend of her beauty reaches the reigning sultan of Hindustan – Allaudin Khilji.", "season": "", "year": "2018", "rating": "7.0", "age_rating": "U/A 13+"},
{"movie_title": "Dr56", "description": "Priya Krishna (Priyamani), a CBI officer, comes to the City for a murder investigation of a mystery case of three neurosurgeons. Arjun is a theater artist who is suffering from an illness and has to take a pill every 56 minutes.  Priya finds Arjun to be a suspect after going through the CCTV footage. It is quite an enjoyable murder mystery that will find welcome by the faithful of that genre.", "season": "", "year": "2022", "rating": "7.8", "age_rating": "U/A 13+"},
{"movie_title": "Varayan", "description": "Kalippakara as the name signifies is a small island village populated by ferocious individuals it's own laws and ways. Outsiders especially policemen have little chance of gaining entry let alone survive in this village. This story is about how Abychen navigates between the two sides with his characteristic smile and love.", "season": "", "year": "2022", "rating": "5.6", "age_rating": "U"},
{"movie_title": "Gaalodu", "description": "Gaalodu (Sudigali Sudheer), an irresponsible youngster, escapes to Hyderabad after accidentally killing the son of his village's head. There, his love affair with the daughter (Gehna Sippy) of a rich businessman lands him in new trouble, eventually dragging him to the court. Can he escape the long arm of the law?", "season": "", "year": "2022", "rating": "6.0", "age_rating": "U/A 13+"},
{"movie_title": "Citadel - Season 1", "description": "Eight years ago, Citadel, an independent global spy agency, was destroyed by a new syndicate, Manticore. With their memories wiped, elite agents Mason Kane (Richard Madden) and Nadia Sinh (Priyanka Chopra Jonas) barely escaped with their lives. Eight years later, Mason’s former colleague, Bernard Orlick (Stanley Tucci), asks for his help to prevent Manticore from establishing a new world order.", "season": "Season 1", "year": "2023", "rating": "", "age_rating": "U/A 16+"},
{"movie_title": "War (Hindi)", "description": "An elite shadow unit of R&AW led by agent Kabir (Hrithik Roshan) focusses on maximum risk missions. Khalid (Tiger Shroff), a soldier with a murky past, struggles to get into Kabir’s team and finally manages to convince him of his dedication & loyalty. Now, when Kabir mysteriously goes rogue, Khalid is assigned the task of hunting down his mentor. Can he track him? A deadly war begins.", "season": "", "year": "2019", "rating": "6.5", "age_rating": "U/A 13+"},
{"movie_title": "Ponniyin Selvan Part 1", "description": "969 AD, The Chola Empire- A period of conspiracies, mysteries, political turmoil and impending war as Pandiya rebels take an oath to spill royal blood and Chola chieftains plan a mutiny. Will the next king be the wild prince Aditya Karikalan, the hermit prince Arunmozhi Varman, their estranged uncle Madhuranthakan or the Pandiya rebel Amarabujanga?", "season": "", "year": "2022", "rating": "7.7", "age_rating": "U/A 16+"},
{"movie_title": "Ponniyin Selvan Part 1 (Hindi)", "description": "969 AD, The Chola Empire- A period of conspiracies, mysteries, political turmoil and impending war as Pandiya rebels take an oath to spill royal blood and Chola chieftains plan a mutiny. Will the next king be the wild prince Aditya Karikalan, the hermit prince Arunmozhi Varman, their estranged uncle Madhuranthakan or the Pandiya rebel Amarabujanga?", "season": "", "year": "2022", "rating": "7.7", "age_rating": "U/A 13+"},
{"movie_title": "Vasantha Mullai", "description": "Rudhran, who works tirelessly for a successful career and money, embarks on a romantic journey to spend quality time with his girlfriend Nila. On the way, he stays at the Vasantha Mullai Motel. The events that unfold in a single night drive Rudhran insane and take him on a roller coaster ride.", "season": "", "year": "2023", "rating": "5.9", "age_rating": "U/A 13+"},
{"movie_title": "HIT (The Second Case)", "description": "Krishna Dev aka KD, a laid back cop, works in AP HIT, has to take up a gruesome murder case. As KD unravels the layers of the crime, the stakes rise unbelievably high and the threat comes unusually close.", "season": "", "year": "2022", "rating": "7.2", "age_rating": "A"},
{"movie_title": "K.G.F Chapter 2 (Hindi)", "description": "Vijendra Ingalgi, Son of Anand Ingalgi continues the story of KGF and Rocky in Chapter 2. Rocky survives the attack by Vanaram’s guards after killing Garuda. He is a hero and a saviour to the people of Narachi. While trying to fulfil his promise to his mother, he must face many obstacles in the form of Adheera, Inayat Khalil and Ramika sen.", "season": "", "year": "2022", "rating": "", "age_rating": "U/A 13+"},
{"movie_title": "Top Gun", "description": "After thirty years, Maverick (Tom Cruise) is still pushing the envelope as a top naval aviator, but must confront ghosts of his past when he leads TOP GUN's elite graduates on a mission that demands the ultimate sacrifice from those chosen to fly it.", "season": "", "year": "2022", "rating": "8.3", "age_rating": "U/A 16+"},
{"movie_title": "Gandhada Gudi", "description": "Intending to return the love and affection showered unconditionally on him, Dr. Puneeth Rajkumar, a mega superstar lovingly known as Appu, sheds his stardom and sets out on an epic journey to explore the marvels of his land. This feature film is an immersive cinematic experience of a true hero, a fascinating journey that he intended to share with the world and make them a part of it.", "season": "", "year": "2022", "rating": "9.1", "age_rating": "U"},
{"movie_title": "Kantara - A Legend", "description": "Kantara is a story set in the fictional village of Dakshina Kannada which explores the ideological conflict of human and nature. A battle of ego swirls along tradition and culture of the land. Will Shiva, the protagonist of the film be able to reinstate peace and harmony in the village perceiving his existence?", "season": "", "year": "2022", "rating": "8.3", "age_rating": "U/A 13+"},
{"movie_title": "Ram Setu", "description": "An atheist archaeologist turned believer must race against time to prove the true existence of the legendary Ram Setu before evil forces destroy the pillar of India’s heritage. An action adventure with a strong serving of twists and turns, ‘Ram Setu’ promises to keep the viewer engaged and entertained, making it the perfect festive film to be enjoyed with the entire family.", "season": "", "year": "2022", "rating": "5.2", "age_rating": "U/A 13+"},
{"movie_title": "Bakasuran", "description": "A man investigates a disturbing ring of young escorts, cyber harassment and suicide. He knows the importance of parents being aware of their children's problems.", "season": "", "year": "2023", "rating": "6.3", "age_rating": "A"},
{"movie_title": "Kranti", "description": "Kranti Rayanna, a businessman, comes back to India after 20 years to celebrate his school's centenary function. During this, he learns that there is a large mafia working to close government schools and privatise education for their profits. How Kranti fights against this mafia forms the rest of the story.", "season": "", "year": "2023", "rating": "7.4", "age_rating": "U/A 13+"},
{"movie_title": "Christopher", "description": "‘Christopher’ is the story of a vigilante cop who is forced to transgress the limits of law when the system fails. The movie travels with the protagonist in a narrative structure that is highly layered. He has a traumatic past which adds fuel to his fury throughout the story. Every act by him is a critique on the law enforcement system and sends out a message to correct the society.", "season": "", "year": "2023", "rating": "6.3", "age_rating": "U/A 13+"},
{"movie_title": "Varisu", "description": "Vijay, the prodigal son of business tycoon Rajendran agrees to take over the reins of the business, much to the chagrin of his brothers. But can Vijay prove himself to be a worthy varisu and also reunite his now-broken family? This movie is also available as Vaarasudu (Telugu), Vamshajan (Malayalam) and Vaarasdara (Kannada)", "season": "", "year": "2023", "rating": "6.1", "age_rating": "U/A 13+"},
{"movie_title": "Vaarasudu", "description": "Vijay, the prodigal son of business tycoon Rajendran agrees to take over the reins of the business, much to the chagrin of his brothers. But can Vijay prove himself to be a worthy varisu and also reunite his now-broken family? This movie is also available as Varisu (Tamil), Vamshajan (Malayalam) and Vaarasdara (Kannada)", "season": "", "year": "2023", "rating": "6.1", "age_rating": "U/A 13+"},
{"movie_title": "Pathaan", "description": "Indian RAW agent “Pathaan” (Shah Rukh Khan) gets to know of a major impending attack against India, mounted by a mercenary group led by the ruthless enigma Jim (John Abraham), who has a history of his own. With the doomsday clock ticking away and an agent Rubai (Deepika Padukone) his only possible ally, Pathaan must fight countless betrayals and deal with destruction as he takes on Jim.", "season": "", "year": "2023", "rating": "6.1", "age_rating": "U/A 13+"},
{"movie_title": "Black Adam", "description": "The story of the DC superhero comes to the big screen in this thrilling action-adventure starring Dwayne Johnson.", "season": "", "year": "2022", "rating": "6.3", "age_rating": "A"}
]